Repository: NNemanjaMM/WebLib
Catalog: elibrary/translations/*/LC_MESSAGES/messages.po
Languages: sr

source: Yes
sr: Da

source: No
sr: Ne

source: Not selected
sr: Nije odabrano

source: Book add
sr: Knjiga - dodavanje

source: Book update
sr: Knjiga - izmena

source: Book error add
sr: Knjiga - dodavanje greške

source: Book error remove
sr: Knjiga - uklanjanje greške

source: Book rent
sr: Knjiga - iznajmljivanje

source: Book return
sr: Knjiga - vraćanje

source: Member add
sr: Član - dodavanje

source: Member update
sr: Član - izmena

source: Membership extension
sr: Članstvo - produženje

source: Price add
sr: Cena - dodavanje

source: Price activation
sr: Cena - onemogućavanje

source: Price deactivation
sr: Cena - omogućavanje

source: Librarian add
sr: Bibliotekar - dodavanje

source: Librarian update
sr: Bibliotekar - izmena

source: Librarian password change
sr: Bibliotekar - izmena lozinke

source: Librarian password change request
sr: Bibliotekar - slanje zahteva za izmenu lozinke

source: Librarian password change response
sr: Bibliotekar - odgovor na zahtev za izmenu lozinke

source: Librarian activation
sr: Bibliotekar - aktiviranje naloga

source: Librarian deactivation
sr: Bibliotekar - deaktiviranje naloga

source: Librarian set as admin
sr: Bibliotekar - dodavanje u administratore

source: Librarian remove admin request
sr: Bibliotekar - zahtev za dodavanje u administratore

source: Librarian remove admin response
sr: Bibliotekar - uklanjanje iz administratora

source: Book with id
sr: Oznaka knjige

source: Member with id
sr: Broj članske karte

source: Price with id
sr: Oznaka cene

source: Inventory number
sr: Inventarni broj

source: Signature
sr: Signatura

source: Title
sr: Naslov

source: Author
sr: Autor

source: Is rented
sr: Je iznajmljena

source: Has error
sr: Ima grešku

source: Filter
sr: Filtriraj

source: Search for
sr: Pretraži za

source: Search
sr: Pretraži

source: book has a problematic inventory number
sr: knjiga ima problem sa inventarnim brojem

source: Update book
sr: Izmeni knjigu

source: Add book
sr: Dodaj knjigu

source: Book with this inventory number
sr: Knjiga sa ovim inventarnim brojem

source: already exists
sr: već postoji

source: Rent date
sr: Datum iznajmljivanja

source: Rent book
sr: Iznajmi knjigu

source: Return date
sr: Datum vraćanja

source: Return book
sr: Vrati knjigu

source: Date can not be set in future
sr: Datum ne može biti postavljen u budućnosti

source: Date cannot be set in past for more than
sr: Datum ne može biti postavljen u prošlosti za više od

source: days
sr: dana

source: Return date can not be set before rent date
sr: Datum vraćanja ne može biti postavljen pre datuma iznajmljivanja

source: Book id
sr: Oznaka knjige

source: Member id
sr: Broj članske karte

source: Is returned
sr: Je vraćena

source: Is deadline passed
sr: Rok za vraćanje je prošao

source: Rent date after
sr: Datum iznajmljivanja nakon

source: Rent date before
sr: Datum iznajmljivanja pre

source: Deadline date after
sr: Rok vraćanja nakon

source: Deadline date before
sr: Rok vraćanja pre

source: Returned date after
sr: Datum vraćanja nakon

source: Returned date before
sr: Datum vraćanja pre

source: There are filter values with errors. However, valid filter values are applied.
sr: Neki od filtera imju grešku u unosu. Filteri sa ispravnim unosom će biti primenjeni.

source: Book data is successfully updated
sr: Podaci o knjizi su uspešno izmenjeni

source: Book is successfully added
sr: Knjiga je uspešno dodata

source: is already rented
sr: je već iznajmljena

source: Please check your inventory number and then continue
sr: Proverite inventarni broj i pokušajte ponovo

source: was not found
sr: nije pronađena

source: An error flag is set to the books with same inventory number
sr: Oznaka greške je postavljena na knjige sa istim inventarnim brojem

source: Book is successfully rented
sr: Knjiga je uspešno iznajmljena

source: Book is successfully returned
sr: Knjiga je uspešno vraćena

source: Event date after
sr: Datum događaja nakon

source: Event date before
sr: Datum događaja pre

source: Librarian
sr: Bibliotekar

source: Event type
sr: Tip događaja

source: Object id
sr: Objekat akcije

source: Price
sr: Cena

source: Note
sr: Beleška

source: Date extended
sr: Datum produženja

source: Extend membership
sr: Produži članstvo

source: Date cannot be set more than
sr: Datum ne može biti postavljen za više od

source: days before the curent membership expiration date
sr: dana pre isteka trenutnog članstva

source: Value is not a valid price
sr: Unesena vrednost ne odgovara ceni

source: Extended after
sr: Datum produženja nakon

source: Extended before
sr: Datum produženja pre

source: Membership expires after
sr: Članstvo ističe nakon

source: Membership expires before
sr: Članstvo ističe pre

source: Approve
sr: Potvrdi

source: Currency
sr: Valuta

source: Enable price upon creation
sr: Aktiviraj cenu po kreiranju

source: Add price
sr: Dodaj cenu

source: Price can not be lower than zero
sr: Cena ne može biti manja od nule

source: Price can not be higher than hundred
sr: Cena ne može biti veće od stotine

source: Price value already exists, please consider activating the existing one
sr: Unesena kombinacija cene i valute već postoji, razmotrite aktiviranje postojeće

source: Membership is successfully extended to
sr: Članstvo je uspešno produženo do

source: Price is successfully added
sr: Cena je uspešno dodata

source: Price availability is successfully updated
sr: Dostupnost cene je uspešno promenjena

source: Username
sr: Korisničko ime

source: Password
sr: Lozinka

source: Login
sr: Prijava

source: First name
sr: Ime

source: Last name
sr: Prezime

source: E-mail address
sr: E-mail adresa

source: Phone
sr: Telefon

source: Address
sr: Adresa

source: That username is taken. Please choose a different one
sr: Odabrano korisničko ime je zauzeto. Odaberite neko drugo

source: Registration date
sr: Datum registracije

source: Confirm password
sr: Potvrdite lozinku

source: This will be library administrator account
sr: Ovo će biti administratorski nalog

source: Add librarian
sr: Dodaj bibliotekara

source: Update librarian
sr: Izmeni podatke

source: Send request
sr: Pošalji zahtev

source: Update password
sr: Izmeni lozinku

source: Old password
sr: Stara lozinka

source: Login unsuccessfull
sr: Neuspešna prijava

source: This user is inactive. For the activation consult the administrator.
sr: Ovaj korisnik je deaktiviran. Za aktivaciju se obratite administratoru.

source: Please check username and password
sr: Proverite korisničko ime i lozinku

source: Reset password request is successfully sent to the administrator
sr: Zahtev za resetovanje lozinke je uspešno poslat administratoru

source: Combination of the username, first name and last name does not exist
sr: Kombinacija korisničkog imena, imena i prezimena nije prepoznata

source: Please check your input and try again
sr: Proverite unos i pokušajte ponovo

source: Password change request
sr: Zahtev za promenu lozinke

source: Account data is successfully updated
sr: Podaci naloga su uspešno izmenjeni

source: Account password is successfully updated
sr: Lozinka naloga je uspešno izmenjena

source: Current password value is not correct
sr: Trenutna lozinka nije ispravna

source: Account is successfully added
sr: Nalog je uspešno dodat

source: Account availability is not updated
sr: Dostupnost naloga nije promenjena

source: Account availability is successfully updated
sr: Dostupnost naloga je uspešno promenjena

source: Add librarian as administrator
sr: Dodaj bilbiotekara u administratore

source: Please approve setting this librarian as the administrator
sr: Potvrdite dodavanje bibliotekara u administratore

source: Librarian removal from administrators request
sr: Zahtev za isključivanje bibliotekara iz administratora

source: Please approve your request to remove this librarian from administrators
sr: Potvrdite zahtev za isključivanje ovog bibliotekara iz administratora

source: Your removal from administrators request
sr: Zahtev za Vaše isključivanje iz administratora

source: Please approve or reject your removal from administrators
sr: Potvrdite ili odbijte zahtev za Vašim isključivanjem iz grupe administratora

source: Librarian is successfully promoted to the administrator
sr: Bibliotekar je uspešno uključen u grupu administratora

source: You successfully created a request to remove librarian from the administrators
sr: Uspešno set kreirali zahtev za isključivanje bibliotekara iz grupe administratora

source: You are successfully removed from the administrators
sr: Uspešno ste isključeni iz grupe administratora

source: You successfully rejected request to be removed from the administrators
sr: Uspešno ste odbili zahtev za Vašim isključivanjem iz grupe administratora

source: Reject
sr: Odbij

source: Father name
sr: Ime oca

source: Profession
sr: Zanimanje

source: Add member
sr: Dodaj člana

source: Update member
sr: Izmeni člana

source: Registered after
sr: Datum prijave nakon

source: Registered before
sr: Datum prijave pre

source: Number of rented books above
sr: Broj iznajmljenih knjiga je preko

source: Number of rented books below
sr: Broj iznajmljenih knjiga je ispod

source: Has currently rented books
sr: Trenutno ima iznajmljene knjige

source: Membership status
sr: Status članstva

source: Membership expired
sr: Članstvo je isteklo

source: Membership near expiration
sr: Članstvo je blizu isteka

source: Membership active
sr: Članstvo je aktivno

source: Member is successfully added
sr: Član je uspešno dodat

source: Member data is successfully updated
sr: Podaci o članu su uspešno izmenjeni

source: Account details
sr: Detalji naloga

source: My account
sr: Moj nalog

source: Account is administrator
sr: Nalog je administratorski

source: Account is active
sr: Nalog je aktivan

source: Password change is requested
sr: Zatražena je promena lozinke

source: Removal from administrators requsted
sr: Zatraženo je uklanjanje iz grupe administratora

source: Set as admin
sr: Ubaci u grupu administratora

source: Remove from admins
sr: Ukloni iz grupe administratora

source: Disable account
sr: Deaktiviraj nalog

source: Enable account
sr: Aktiviraj nalog

source: This is your account. If you wish to edit it, please go to page
sr: Ovo je Vaš nalog. Ukoliko želite da ga izmenite, posetite stranicu

source: Update account
sr: Izmeni nalog

source: Handle remove from admins
sr: Odgovori na zahtev za uklanjanje iz grupe administratora

source: For a librarian
sr: Za bibliotekara

source: Current username
sr: Trenutno korisničko ime

source: Librarian's account availability update
sr: Izmena dostupnosti naloga bibliotekara

source: Current status
sr: Trenutni status

source: Enabled
sr: Aktivan

source: Disabled
sr: Neaktivan

source: Do you approve librarian's account availability update
sr: Potvrdite promenu dostupnosti naloga bibliotekara

source: From
sr: Iz

source: to
sr: u

source: e-Library
sr: e-Biblioteka

source: Home
sr: Početna

source: Books
sr: Knjige

source: Members
sr: Članovi

source: Memberships
sr: Članstva

source: Rents
sr: Iznajmljivanja

source: Librarians
sr: Bibliotekari

source: Events
sr: Događaji

source: Logout
sr: Odjava

source: Clear search
sr: Očisti pretragu

source: Clear filter
sr: Očisti filtere

source: Rent details
sr: Detalji iznajmljivanja

source: Number of items in list
sr: Broj stavki u listi

source: Book has a problem with inventory number
sr: Knjiga ima problem sa inventarnim brojem

source: Please uncheck if the problem with inventory number is resolved
sr: Molimo Vas odznačite ukoliko je problem sa inventarnim brojem rešen

source: Event details
sr: Detalji događaja

source: Date and time
sr: Datum i vreme

source: Performed by
sr: Akciju izvršio

source: Performed on
sr: Objekat akcije

source: Description
sr: Opis akcije

source: Type
sr: Tip

source: For a member
sr: Za člana

source: Membership number
sr: Broj članske karte

source: Member
sr: Član

source: Expiration date
sr: Datum isteka

source: Expired
sr: Istekla

source: Membership expiration date will be set a year after the date of membership extension
sr: Datum isteka produženja članstva biće postavljen na godinu dana od datuma produženja članstva

source: Membership expiration date will be set a year after the current membership expiration
sr: Datum isteka produženja članstva biće postavljen na godinu dana nakon isteka trenutnog članstva

source: Cancel
sr: Odustani

source: Defined prices
sr: Definisane cene

source: Create price
sr: Dodaj cenu

source: Value
sr: Iznos

source: Price is enabled
sr: Cena je aktivna

source: (no note inserted)
sr: (nije unesen komentar)

source: Enable
sr: Aktiviraj

source: Disable
sr: Deaktiviraj

source: Price update
sr: Izmena cene

source: For a price
sr: Za cenu

source: This price is currently
sr: Ova cena je trenutno

source: Enabled
sr: Aktivna

source: Disabled
sr: Neaktivna

source: This price will be
sr: Ova cena će postati

source: and the comment will be updated
sr: i komentar će biti izmenjen

source: Please approve or reject action
sr: Molimo Vas odobrite ili odbijte akciju

source: Review prices
sr: Pregled cena

source: Date performed
sr: Datum produženja

source: Membership expires
sr: Članstvo ističe

source: Do not include inactive librarians
sr: Ne prikazuj neaktivne bibliotekare

source: Include inactive librarians
sr: Prikaži i neaktivne bibliotekare

source: Is administrator
sr: Je administrator

source: Is not administrator
sr: Nije administrator

source: Is not active
sr: Nije aktivan

source: Requested password change
sr: Zatražena je promena lozinke

source: Requested removal from admins
sr: Zatraži uklanjanje iz grupe administratora

source: More details
sr: Više detalja

source: Request the administrator to
sr: Zatraži od administratora da

source: reset your password
sr: resetuje moju lozinku

source: Go back to the
sr: Vrati se na

source: login page
sr: stranicu za prijavu

source: Member details
sr: Detalji člana

source: Membership not active
sr: Članstvo je isteklo

source: Membership expiration date
sr: Datum isteka članstva

source: Total number of rented books
sr: Ukupan broj iznajmljenih knjiga

source: Number of currently rented books
sr: Broj trenutno iznajmljenih knjiga

source: Update member data
sr: Izmeni podatke člana

source: Members without active membership can not rent a book
sr: Članovi kojima je isteklo članstvo ne mogu iznajmiti knjigu

source: Members can not rent more than
sr: Članovi ne mogu iznajmiti više od

source: books at a time
sr: knjiga u isto vreme

source: Currently rented
sr: Trenutno iznajmljeno

source: Deadline passed
sr: Rok istekao

source: All rented books
sr: Sve iznajmljene knjige

source: Total books rented
sr: Ukupno iznajmljeno knjiga

source: Currently rented books
sr: Trenutno iznajmljeno knjiga

source: Book returned after deadline
sr: Knjiga vraćena nakon roka

source: Book returned on time
sr: Knjiga vraćena na vreme

source: Date rented
sr: Datum iznajmljivanja

source: Deadline
sr: Rok za vraćanje

source: Book returned
sr: Knjiga je vraćena

source: on
sr: na

source: Book rented
sr: Iznajmljena knjiga

source: id
sr: br

source: Member info
sr: Podaci o članu

source: If the book is returned, please fill date of the book return, and submit the data.
sr: Ukoliko je knjiga vraćena, popunite datum vraćanja i stisnite odgovarajuće dugme

source: Book info
sr: Podaci o knjizi

source: When this filter is used, filtered items can not be sorted
sr: Kada se koristi ovaj filter nije moguće sortiranje tabele po kolonama

source: Date returned
sr: Datum vraćanja

source: You do not have permission to perform requested action or access the requested page.
sr: Nemate dozvolu da izvršite traženu akciju ili pristupite traženoj stranici.

source: Please check with your administrator if you should be able to perform this action or access the requested page.
sr: Molimo Vas proverite sa administratorom da li vam je potrebna dozvola za izvršavanje tražene akcije ili pristup traženoj stranici.

source: Meanwhile, you can perform other actions or access other pages - use the menu at the top of the page.
sr: U međuvremenu, možete izvršiti neku od akcija koje su vam dostupne u navigacionom meniju.

source: The page or requesred resource does not exist.
sr: Tražena stranica ili resurs nisu dostupni.

source: Please choose a different page or resource.
sr: Molimo Vas odaberite drugu stranicu ili resurs.

source: The method requested is not allowed under the current circumstances.
sr: Traženu akciju nije moguće izvršiti pod trenutnim okolnostima.

source: The execution may result in the application misbehavior.
sr: Izvršavanje tražene akcije može prouzrokovati grešku u radu aplikacije.

source: Please choose a different action or try to change the account.
sr: Molimo Vas odaberite drugu akciju, ili probajte sa drugim nalogom.

source: We are experiencing some trouble with the application.
sr: Trenutno postoje problemi sa aplikacijom.

source: Please check your parameters and try again. If the problem persists contact the application provider.
sr: Molmo vas proverite parametre zahteva i pokušajte ponovo. Ukoliko problem i dalje postoji, kontaktirajte proizvođača aplikacije.

source: Field can not be empty
sr: Polje ne može ostati prazno

source: Value is not a valid date
sr: Vrednost ne odgovara validnom datumu

source: Make sure it matches the following format
sr: Proverite da li odgovara sledećem formatu

source: Value is not a valid decimal number
sr: Vrednost ne odgovara validnom decimalnom broju

source: Make sure it uses dot as decimal point
sr: Proverite da li koristi tačku kao decimalni zarez

source: Value does not match e-mail address format
sr: Vrednost ne odgovara validnoj e-mail adresi

source: Value does not match expected phone number format
sr: Vrednost ne odgovara očekivanom formatu broja telefona

source: E.g. 069/1128767, 0691128767, +387691128767, 059/343565, 059343565, +38759343565
sr: Npr. 069/1128767, 0691128767, +387691128767, 059/343565, 059343565, +38759343565

source: Only letters, numbers, spaces, dots, commas, and hyphens are allowed
sr: Samo slova, cifre, razmaci, tačke, zarezi i povlake su dozvoljeni

source: Only upper case letters are allowed
sr: Samo velika slova su dozvoljena

source: Only letters, numbers, and following characters are allowed
sr: Samo slova, cifre i sledeći krakteri su dozvoljeni

source: Only numbers, dots, and hyphens are allowed
sr: Samo cifre, tačke i povlake su dozvoljeni

source: Only digits are allowed
sr: Samo cifre su dozvoljene

source: does not match the
sr: ne odgovara

source: Input length must be between
sr: Dužina unosa mora biti između

source: characters
sr: karaktera

source: Maximum input length is
sr: Dužina unosa mora biti kraća od

source: Minimum input length is
sr: Dužina unosa mora biti duža od

source: Date can not be set before
sr: Odabrani datum ne može biti pre

source: "After" date value can not be set after the "before" date value
sr: "Nakon" vrednost datuma ne može biti posle "pre" vrednosti datuma

source: Value is not a valid whole number
sr: Vrednost ne odgovara validnom celom broju

source: Number can not be lower than zero
sr: Broj ne može biti manji od nule

source: Number can not be higher than
sr: Broj ne može biti veći od

source: "Higher than" value can not be greater than "lower than" value
sr: "Veće od" vrednost ne može biti veća od "manje od" vrednosti
